---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RenderRpcFilename
source: html/14d6b602-6150-412f-3f17-2ff87bf4e373.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RenderRpcFilename Property

"Render Appearance"

## Syntax (C#)
```csharp
public static ForgeTypeId RenderRpcFilename { get; }
```